<a href="https://colab.research.google.com/github/DenilsonPaco98/Pandas_lesson/blob/main/Pandas_lesson2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1>Bem Vindo !

Este é um mini introdutório do pandas em python, estarei mandando mais e mais tutorias será disponibilizado o arquivo CSV, utilizado neste notebook e assim poderam se divertir um pouco!

Segue meu github :https://github.com/DenilsonPaco98

Linkedin : https://www.linkedin.com/in/denilson-paco-24b629181/

CSV : https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv

** Recurso retirado diretamentamente da Documentação :

![image.png]()

In [ ]:
#Para se fazer uma importação em pandas 
import pandas as pd

In [ ]:
#Pandas trabalha com Dataframe , vamos criar um !

df = pd.DataFrame(

    {
        "Name":[
                "Denilson, Paco Quispe",
                "João, Vinicius Da Costa",
                "Ricardo, Fontoura Lopes",
        ],
          "Age":[20,30,36],
        "Sex":["masc","fem","masc"]
    }

)

In [ ]:
df

                      Name  Age   Sex
0    Denilson, Paco Quispe   20  masc
1  João, Vinicius Da Costa   30   fem
2  Ricardo, Fontoura Lopes   36  masc

In [ ]:
#Estou apenas interessado em trabalhar com os dados da coluna "AGE"
df["Age"]

0    20
1    30
2    36
Name: Age, dtype: int64

In [ ]:
#Se estiver familiarizado com o python vc pode criar uma séries do zero
ages = pd.Series([22,36,45], name="Age")
display(ages)

0    22
1    36
2    45
Name: Age, dtype: int64

In [ ]:
display(df)

                      Name  Age   Sex
0    Denilson, Paco Quispe   20  masc
1  João, Vinicius Da Costa   30   fem
2  Ricardo, Fontoura Lopes   36  masc

In [ ]:
#A idade maxima dos passageiros
df["Age"].max()

36

In [ ]:
ages.max()

45

In [ ]:
#A função describe() ajuda a dar uma descrição geral sobre a média,soma,min ... e entre outras
df.describe()

             Age
count   3.000000
mean   28.666667
std     8.082904
min    20.000000
25%    25.000000
50%    30.000000
75%    33.000000
max    36.000000

In [ ]:
#Vou jogar o nome na qual se chamará meu DataFrame : 'titanic_df' e lemos o arquivo com o pd.read_"type archive"("name archive")
titanic_df = pd.read_csv("titanic.csv")

In [ ]:
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
#para retornar as primeiras linhas do arquivo use o metodo head()
titanic_df.head(8)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S

[8 rows x 12 columns]

In [ ]:
#para retornar as ultimas linhas do arquivo use o metodo tail()
titanic_df.tail(8)

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
883          884         0       2  ...  10.500   NaN         S
884          885         0       3  ...   7.050   NaN         S
885          886         0       3  ...  29.125   NaN         Q
886          887         0       2  ...  13.000   NaN         S
887          888         1       1  ...  30.000   B42         S
888          889         0       3  ...  23.450   NaN         S
889          890         1       1  ...  30.000  C148         C
890          891         0       3  ...   7.750   NaN         Q

[8 rows x 12 columns]

In [ ]:
#função type ele serve para retornar o valor que contem em cada coluna 
titanic_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
titanic_df.to_excel("titanic.xlsx", sheet_name="passengers", index=False)

In [ ]:
titanic_df = pd.read_excel("titanic.xlsx", sheet_name="passengers")

In [ ]:
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
#O método info()fornece informações técnicas sobre um DataFrame, então vamos explicar a saída com mais detalhes:

#É realmente um DataFrame.

#Existem 891 entradas, ou seja, 891 linhas.

#Cada linha possui um rótulo de linha (também conhecido como index) com valores que variam de 0 a 890.

#A tabela possui 12 colunas. A maioria das colunas tem um valor para cada uma das linhas (todos os 891 valores têm non-null). Algumas colunas têm valores ausentes e menos de 891 non-nullvalores.

#As colunas Name, Sex, Cabine Embarkedconsiste de dados textuais (cordas, aka object). As outras colunas são dados numéricos com alguns deles números inteiros (aka integer) e outros são números reais (aka float).

#O tipo de dados (caracteres, inteiros, ...) nas diferentes colunas são resumidos listando o dtypes.

#A quantidade aproximada de RAM usada para armazenar o DataFrame também é fornecida.
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
#Selecionando colunas especificas de um DataFrame
ages = titanic_df["Age"]

In [27]:
ages.head(8)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
Name: Age, dtype: float64

In [28]:
#Para selecionar uma única coluna, use colchetes []com o nome da coluna de interesse.

#Cada coluna em a DataFrameé um Series. 
type(titanic_df["Age"])

pandas.core.series.Series

In [30]:
#Relembrando que a função shape ele demonstra quantas linhas te no meu DataFrame
titanic_df["Age"].shape

(891,)

In [31]:
#vamos selecionar 2 colunas do meu df
age_sex = titanic_df[["Age","Sex"]]

In [34]:
age_sex.head(8)

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male
5   NaN    male
6  54.0    male
7   2.0    male

In [36]:
#Vamos verificar os tipos de dados extraidos do DF
type(titanic_df[["Age","Sex"]])

pandas.core.frame.DataFrame

<h1><font color="red" >Como posso filtrar linhas específicas de um DataFrame?</font</h1>

![image.png]()

In [39]:
#Estou interessado nos passageiros com mais de 35 anos.
acima_35 = titanic_df[titanic_df["Age"] > 35]
acima_35.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
6             7         0       1  ...  51.8625   E46         S
11           12         1       1  ...  26.5500  C103         S
13           14         0       3  ...  31.2750   NaN         S
15           16         1       2  ...  16.0000   NaN         S

[5 rows x 12 columns]

In [40]:
#A condição dentro dos colchetes de seleção verifica para quais linhas a coluna tem um valor maior que 35:titanic["Age"] > 35Age
titanic_df["Age"] > 35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

A saída da expressão condicional ( >, mas também ==, !=, <, <=, ... iria funcionar) é realmente um pandas Seriesde valores booleanos (quer Trueou False) com o mesmo número de linhas que o original DataFrame. Esses Seriesvalores booleanos podem ser usados ​​para filtrar o DataFrame, colocando-o entre os colchetes de seleção [ ]. Apenas as linhas para as quais o valor é True serão selecionadas.


Já sabemos que o Titanic original DataFrameconsiste em 891 linhas. Vamos dar uma olhada no número de linhas que satisfazem a condição, verificando o shapeatributo do resultado DataFrame above_35:

In [42]:
#vamos verificar quantas linhas contem nossa seleção sobre idades acima de 35
acima_35.shape

(217, 12)

In [44]:
#Estou interessado sobre os passageiros sobre as classe 2 e 3.
class_23 = titanic_df[titanic_df["Pclass"].isin([2,3])] 
class_23.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
2            3         1       3  ...   7.9250   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

**O acima é equivalente a filtrar por linhas para as quais a classe é 2 ou 3 e combinar as duas instruções com um |operador (ou):**

In [45]:
class_23 = titanic_df[(titanic_df["Pclass"] == 2) | (titanic_df["Pclass"] == 3 )]

In [46]:
class_23.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
2            3         1       3  ...   7.9250   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

<h1>Quero trabalhar com dados de passageiros cuja idade é conhecida.<h1>

In [47]:
#A notna()função condicional retorna um Truepara cada linha, os valores não são um Nullvalor. Como tal, isso pode ser combinado com os colchetes de seleção []para filtrar a tabela de dados.
idade_sem_null = titanic_df[titanic_df["Age"].notna()]
idade_sem_null.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [48]:
#Você pode se perguntar o que realmente mudou, já que as 5 primeiras linhas ainda são os mesmos valores. Uma maneira de verificar é verificar se a forma mudou:
idade_sem_null.shape

(714, 12)

<h1><font color="red">Como seleciono linhas e colunas específicas de um DataFrame?</font><h1>

![image.png]()

In [49]:
#Estou interessado nos nomes dos passageiros com mais de 35 anos.
nomes_adultos = titanic_df.loc[titanic_df["Age"] > 35,"Name"]
nomes_adultos.head()

1     Cumings, Mrs. John Bradley (Florence Briggs Th...
6                               McCarthy, Mr. Timothy J
11                             Bonnell, Miss. Elizabeth
13                          Andersson, Mr. Anders Johan
15                     Hewlett, Mrs. (Mary D Kingcome)
Name: Name, dtype: object

Neste caso, um subconjunto de linhas e colunas é feito de uma vez e apenas usar os colchetes de seleção [ ]não é mais suficiente. Os operadores loc/ ilocsão necessários na frente dos colchetes de seleção [ ]. Ao usar loc/ iloc, a parte antes da vírgula são as linhas que você deseja e a parte depois da vírgula são as colunas que você deseja selecionar.

Ao usar os nomes das colunas, rótulos de linha ou uma expressão de condição, use o locoperador na frente dos colchetes de seleção []. Para a parte antes e depois da vírgula, você pode usar um único rótulo, uma lista de rótulos, uma fatia de rótulos, uma expressão condicional ou dois pontos. Usar dois pontos especifica que você deseja selecionar todas as linhas ou colunas.

**Estou interessado nas linhas 10 a 25 e nas colunas 3 a 5 .**

In [51]:
#Função iloc ele pega as linhas e colunas que voce deseja obter 
titanic_df.iloc[9:25,2:5]

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female

Novamente, um subconjunto de linhas e colunas é feito de uma vez e apenas usar colchetes de seleção []não é mais suficiente. Quando estiver especificamente interessado em certas linhas e / ou colunas com base em sua posição na tabela, use o ilocoperador na frente dos colchetes de seleção [ ].

In [52]:
#Ao selecionar linhas e / ou colunas específicas com locou iloc, novos valores podem ser atribuídos aos dados selecionados. Por exemplo, para atribuir o nome anonymousaos 3 primeiros elementos da terceira coluna:
titanic_df.iloc[0:3,3] = "anonymous"
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [53]:
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]